Terraform plan in __.__
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # auth0_client.ndsq_app will be created
  + resource "auth0_client" "ndsq_app" {
      + client_id                           = (known after apply)
      + client_secret                       = (sensitive value)
      + custom_login_page_on                = (known after apply)
      + grant_types                         = (known after apply)
      + id                                  = (known after apply)
      + is_first_party                      = (known after apply)
      + is_token_endpoint_ip_header_trusted = (known after apply)
      + name                                = "NDSquared Application (Managed by Terraform)"
      + oidc_conformant                     = (known after apply)
      + token_endpoint_auth_method          = (known after apply)

      + jwt_configuration {
          + alg                 = (known after apply)
          + lifetime_in_seconds = (known after apply)
          + scopes              = (known after apply)
          + secret_encoded      = (known after apply)
        }

      + refresh_token {
          + expiration_type              = (known after apply)
          + idle_token_lifetime          = (known after apply)
          + infinite_idle_token_lifetime = (known after apply)
          + infinite_token_lifetime      = (known after apply)
          + leeway                       = (known after apply)
          + rotation_type                = (known after apply)
          + token_lifetime               = (known after apply)
        }
    }

  # auth0_client_grant.ndsq_client_grants will be created
  + resource "auth0_client_grant" "ndsq_client_grants" {
      + audience  = "https://api.ndsquared.net"
      + client_id = (known after apply)
      + id        = (known after apply)
      + scope     = [
          + "read:connectfour",
        ]
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Terraform CI #3](https://github.com/dannylongeuay/auth0-infra/actions/runs/1648139011)